run/navalFoam/twoBoats/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.1;

vertices
(
    // Plane 1
    ( -7    -1.5   -4)
    ( -0.5  -1.5   -4)
    (  1    -1.5   -4)
    (  3.1  -1.5   -4)
    (  4.5  -1.5   -4)
    ( 15    -1.5   -4)

    ( -7    -0.3   -4)
    ( -0.5  -0.3   -4)
    (  1    -0.3   -4)
    (  3.1  -0.3   -4)
    (  4.5  -0.3   -4)
    ( 15    -0.3   -4)

    ( -7     0.3   -4)
    ( -1     0.3   -4)
    (  1     0.3   -4)
    (  2.5   0.3   -4)
    (  4.5   0.3   -4)
    ( 15     0.3   -4)

    ( -7     1.5   -4)
    ( -1     1.5   -4)
    (  1     1.5   -4)
    (  2.5   1.5   -4)
    (  4.5   1.5   -4)
    ( 15     1.5   -4)

    // Plane 2
    ( -7    -1.5   -1)
    ( -0.5  -1.5   -1)
    (  1    -1.5   -1)
    (  3.1  -1.5   -1)
    (  4.5  -1.5   -1)
    ( 15    -1.5   -1)

    ( -7    -0.3   -1)
    ( -0.5  -0.3   -1)
    (  1    -0.3   -1)
    (  3.1  -0.3   -1)
    (  4.5  -0.3   -1)
    ( 15    -0.3   -1)

    ( -7     0.3   -1)
    ( -1     0.3   -1)
    (  1     0.3   -1)
    (  2.5   0.3   -1)
    (  4.5   0.3   -1)
    ( 15     0.3   -1)

    ( -7     1.5   -1)
    ( -1     1.5   -1)
    (  1     1.5   -1)
    (  2.5   1.5   -1)
    (  4.5   1.5   -1)
    ( 15     1.5   -1)

    // Plane 3
    ( -7    -1.5    0)
    ( -0.5  -1.5    0)
    (  1    -1.5    0)
    (  3.1  -1.5    0)
    (  4.5  -1.5    0)
    ( 15    -1.5    0)

    ( -7    -0.3    0)
    ( -0.5  -0.3    0)
    (  1    -0.3    0)
    (  3.1  -0.3    0)
    (  4.5  -0.3    0)
    ( 15    -0.3    0)

    ( -7     0.3    0)
    ( -1     0.3    0)
    (  1     0.3    0)
    (  2.5   0.3    0)
    (  4.5   0.3    0)
    ( 15     0.3    0)

    ( -7     1.5    0)
    ( -1     1.5    0)
    (  1     1.5    0)
    (  2.5   1.5    0)
    (  4.5   1.5    0)
    ( 15     1.5    0)

    // Plane 4
    ( -7    -1.5    1)
    ( -0.5  -1.5    1)
    (  1    -1.5    1)
    (  3.1  -1.5    1)
    (  4.5  -1.5    1)
    ( 15    -1.5    1)

    ( -7    -0.3    1)
    ( -0.5  -0.3    1)
    (  1    -0.3    1)
    (  3.1  -0.3    1)
    (  4.5  -0.3    1)
    ( 15    -0.3    1)

    ( -7     0.3    1)
    ( -1     0.3    1)
    (  1     0.3    1)
    (  2.5   0.3    1)
    (  4.5   0.3    1)
    ( 15     0.3    1)

    ( -7     1.5    1)
    ( -1     1.5    1)
    (  1     1.5    1)
    (  2.5   1.5    1)
    (  4.5   1.5    1)
    ( 15     1.5    1)

    // Plane 5
    ( -7    -1.5    4)
    ( -0.5  -1.5    4)
    (  1    -1.5    4)
    (  3.1  -1.5    4)
    (  4.5  -1.5    4)
    ( 15    -1.5    4)

    ( -7    -0.3    4)
    ( -0.5  -0.3    4)
    (  1    -0.3    4)
    (  3.1  -0.3    4)
    (  4.5  -0.3    4)
    ( 15    -0.3    4)

    ( -7     0.3    4)
    ( -1     0.3    4)
    (  1     0.3    4)
    (  2.5   0.3    4)
    (  4.5   0.3    4)
    ( 15     0.3    4)

    ( -7     1.5    4)
    ( -1     1.5    4)
    (  1     1.5    4)
    (  2.5   1.5    4)
    (  4.5   1.5    4)
    ( 15     1.5    4)
);

blocks
(
    // First plane
    hex (0 1 7 6 24 25 31 30) (40 10 12) simpleGrading (0.2 1 0.2)
    hex (1 2 8 7 25 26 32 31) (30 10 12) simpleGrading (1 1 0.2)
    hex (2 3 9 8 26 27 33 32) (35 10 12) simpleGrading (1 1 0.2)
    hex (3 4 10 9 27 28 34 33) (30 10 12) simpleGrading (1 1 0.2)
    hex (4 5 11 10 28 29 35 34) (75 10 12) simpleGrading (5 1 0.2)

    hex (6 7 13 12 30 31 37 36) (40 10 12) simpleGrading (0.2 1 0.2)
    hex (7 8 14 13 31 32 38 37) (30 10 12) simpleGrading (1 1 0.2)
    hex (8 9 15 14 32 33 39 38) (35 10 12) simpleGrading (1 1 0.2)
    hex (9 10 16 15 33 34 40 39) (30 10 12) simpleGrading (1 1 0.2)
    hex (10 11 17 16 34 35 41 40) (75 10 12) simpleGrading (5 1 0.2)

    hex (12 13 19 18 36 37 43 42) (40 10 12) simpleGrading (0.2 1 0.2)
    hex (13 14 20 19 37 38 44 43) (30 10 12) simpleGrading (1 1 0.2)
    hex (14 15 21 20 38 39 45 44) (35 10 12) simpleGrading (1 1 0.2)
    hex (15 16 22 21 39 40 46 45) (30 10 12) simpleGrading (1 1 0.2)
    hex (16 17 23 22 40 41 47 46) (75 10 12) simpleGrading (5 1 0.2)

    // Second plane
    hex (24 25 31 30 48 49 55 54) (40 10 15) simpleGrading (0.2 1 1)
    hex (25 26 32 31 49 50 56 55) (30 10 15) simpleGrading (1 1 1)
    hex (26 27 33 32 50 51 57 56) (35 10 15) simpleGrading (1 1 1)
    hex (27 28 34 33 51 52 58 57) (30 10 15) simpleGrading (1 1 1)
    hex (28 29 35 34 52 53 59 58) (75 10 15) simpleGrading (5 1 1)

    hex (30 31 37 36 54 55 61 60) (40 10 15) simpleGrading (0.2 1 1)
    hex (31 32 38 37 55 56 62 61) (30 10 15) simpleGrading (1 1 1)
    hex (32 33 39 38 56 57 63 62) (35 10 15) simpleGrading (1 1 1)
    // Skip, boat 2
    hex (34 35 41 40 58 59 65 64) (75 10 15) simpleGrading (5 1 1)

    hex (36 37 43 42 60 61 67 66) (40 10 15) simpleGrading (0.2 1 1)
    hex (37 38 44 43 61 62 68 67) (30 10 15) simpleGrading (1 1 1)
    hex (38 39 45 44 62 63 69 68) (35 10 15) simpleGrading (1 1 1)
    hex (39 40 46 45 63 64 70 69) (30 10 15) simpleGrading (1 1 1)
    hex (40 41 47 46 64 65 71 70) (75 10 15) simpleGrading (5 1 1)

    // Third plane
    hex (48 49 55 54 72 73 79 78) (40 10 15) simpleGrading (0.2 1 1)
    hex (49 50 56 55 73 74 80 79) (30 10 15) simpleGrading (1 1 1)
    hex (50 51 57 56 74 75 81 80) (35 10 15) simpleGrading (1 1 1)
    hex (51 52 58 57 75 76 82 81) (30 10 15) simpleGrading (1 1 1)
    hex (52 53 59 58 76 77 83 82) (75 10 15) simpleGrading (5 1 1)

    hex (54 55 61 60 78 79 85 84) (40 10 15) simpleGrading (0.2 1 1)
    // Skip, boat 1
    hex (56 57 63 62 80 81 87 86) (35 10 15) simpleGrading (1 1 1)
    hex (57 58 64 63 81 82 88 87) (30 10 15) simpleGrading (1 1 1)
    hex (58 59 65 64 82 83 89 88) (75 10 15) simpleGrading (5 1 1)

    hex (60 61 67 66 84 85 91 90) (40 10 15) simpleGrading (0.2 1 1)
    hex (61 62 68 67 85 86 92 91) (30 10 15) simpleGrading (1 1 1)
    hex (62 63 69 68 86 87 93 92) (35 10 15) simpleGrading (1 1 1)
    hex (63 64 70 69 87 88 94 93) (30 10 15) simpleGrading (1 1 1)
    hex (64 65 71 70 88 89 95 94) (75 10 15) simpleGrading (5 1 1)

    // Fifth plane
    hex (72 73 79 78 96 97 103 102) (40 10 12) simpleGrading (0.2 1 5)
    hex (73 74 80 79 97 98 104 103) (30 10 12) simpleGrading (1 1 5)
    hex (74 75 81 80 98 99 105 104) (35 10 12) simpleGrading (1 1 5)
    hex (75 76 82 81 99 100 106 105) (30 10 12) simpleGrading (1 1 5)
    hex (76 77 83 82 100 101 107 106) (75 10 12) simpleGrading (5 1 5)

    hex (78 79 85 84 102 103 109 108) (40 10 12) simpleGrading (0.2 1 5)
    hex (79 80 86 85 103 104 110 109) (30 10 12) simpleGrading (1 1 5)
    hex (80 81 87 86 104 105 111 110) (35 10 12) simpleGrading (1 1 5)
    hex (81 82 88 87 105 106 112 111) (30 10 12) simpleGrading (1 1 5)
    hex (82 83 89 88 106 107 113 112) (75 10 12) simpleGrading (5 1 5)

    hex (84 85 91 90 108 109 115 114) (40 10 12) simpleGrading (0.2 1 5)
    hex (85 86 92 91 109 110 116 115) (30 10 12) simpleGrading (1 1 5)
    hex (86 87 93 92 110 111 117 116) (35 10 12) simpleGrading (1 1 5)
    hex (87 88 94 93 111 112 118 117) (30 10 12) simpleGrading (1 1 5)
    hex (88 89 95 94 112 113 119 118) (75 10 12) simpleGrading (5 1 5)
);

edges           
(
);

patches         
(
    wall frontBoat
    (
        (55 56 80 79)
        (56 62 86 80)
        (62 61 85 86)
        (61 55 79 85)
        (55 61 62 56)
        (79 80 86 85)
    )

    wall backBoat
    (
        (33 34 58 57)
        (34 40 64 58)
        (40 39 63 64)
        (39 33 57 63)
        (33 39 40 34)
        (57 58 64 63)
    )

    patch in
    (
        (0 24 30 6)
        (6 30 36 12)
        (12 36 42 18)

        (24 48 54 30)
        (30 54 60 36)
        (36 60 66 42)

        (48 72 78 54)
        (54 78 84 60)
        (60 84 90 66)

        (72 96 102 78)
        (78 102 108 84)
        (84 108 114 90)
    )

    patch out
    (
        (5 11 35 29)
        (11 17 41 35)
        (17 23 47 41)

        (29 35 59 53)
        (35 41 65 59)
        (41 47 71 65)

        (53 59 83 77)
        (59 65 89 83)
        (65 71 95 89)

        (77 83 107 101)
        (83 89 113 107)
        (89 95 119 113)
    )

    patch bottom
    (
        (0 1 25 24)
        (1 2 26 25)
        (2 3 27 26)
        (3 4 28 27)
        (4 5 29 28)

        (24 25 49 48)
        (25 26 50 49)
        (26 27 51 50)
        (27 28 52 51)
        (28 29 53 52)

        (48 49 73 72)
        (49 50 74 73)
        (50 51 75 74)
        (51 52 76 75)
        (52 53 77 76)

        (72 73 97 96)
        (73 74 98 97)
        (74 75 99 98)
        (75 76 100 99)
        (76 77 101 100)
    )

    patch top
    (
        (18 42 43 19)
        (19 43 44 20)
        (20 44 45 21)
        (21 45 46 22)
        (22 46 47 23)

        (42 66 67 43)
        (43 67 68 44)
        (44 68 69 45)
        (45 69 70 46)
        (46 70 71 47)

        (66 90 91 67)
        (67 91 92 68)
        (68 92 93 69)
        (69 93 94 70)
        (70 94 95 71)

        (90 114 115 91)
        (91 115 116 92)
        (92 116 117 93)
        (93 117 118 94)
        (94 118 119 95)
    )

    patch back
    (
        (0 6 7 1)
        (1 7 8 2)
        (2 8 9 3)
        (3 9 10 4)
        (4 10 11 5)

        (6 12 13 7)
        (7 13 14 8)
        (8 14 15 9)
        (9 15 16 10)
        (10 16 17 11)

        (12 18 19 13)
        (13 19 20 14)
        (14 20 21 15)
        (15 21 22 16)
        (16 22 23 17)
    )

    patch front
    (
        (96 97 103 102)
        (97 98 104 103)
        (98 99 105 104)
        (99 100 106 105)
        (100 101 107 106)

        (102 103 109 108)
        (103 104 110 109)
        (104 105 111 110)
        (105 106 112 111)
        (106 107 113 112)

        (108 109 115 114)
        (109 110 116 115)
        (110 111 117 116)
        (111 112 118 117)
        (112 113 119 118)
    )
);

mergePatchPairs 
();


// ************************************************************************* //
