run/navalFoam/twoBoats/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          motionProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dynamicFvMesh   staticFvMesh;
dynamicFvMesh   sixDofMotion;

sixDofMotionCoeffs
{
    bodies
    (
        frontBoat
        {
            hullPatches      ( frontBoat );

            addPropulsionForce      no;
            propulsionDirection     (-1 0 0);
            propulsionForceCentroid (0 0 0);

            centreOfSlider  (0 0 0);
            hullSlider      none;
            fixedSlider     none;
            hullSliderZone  none;
            fixedSliderZone none;

            odeSolver       RK;
            epsilon         0.001;

            fixedSurge      no;
            fixedSway       no;
            fixedHeave      no;

            fixedRoll       no;
            fixedPitch      no;
            fixedYaw        no;

            steadyState     no;
        }

        backBoat
        {
            hullPatches      ( backBoat );

            addPropulsionForce      no;
            propulsionDirection     (-1 0 0);
            propulsionForceCentroid (0 0 0);

            centreOfSlider  (0 0 0);
            hullSlider      none;
            fixedSlider     none;
            hullSliderZone  none;
            fixedSliderZone none;
            centreOfSlider  (0 0 0);

            odeSolver       RK;
            epsilon         0.001;

            fixedSurge      no;
            fixedSway       no;
            fixedHeave      no;

            fixedRoll       no;
            fixedPitch      no;
            fixedYaw        no;

            steadyState     no;
        }
    );
}

solver          laplaceFaceDecomposition;
diffusivity     quadratic;

twoDMotion      no;
frozenDiffusion on;

distancePatches
(
    frontBoat
    backBoat
);

// ************************************************************************* //
