run/navalFoam/twoBoats/0/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           tetPointVectorField;
    object          motionU;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontBoat
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    backBoat
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    in
    {
        type            slip;
    }

    out
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    top
    {
        type            slip;
    }

    back
    {
        type            slip;
    }

    front
    {
        type            slip;
    }
}

// ************************************************************************* //
